(function () {
    angular
		.module('infotainment')
		.controller('gmaeNewsCtrl', gmaeNewsCtrl);

    function gmaeNewsCtrl($scope, $state, $filter, $http, $location, $window, $q, $sce, $modal, $compile) {

        $scope.Title = "खबर राज्यों से";

        $scope.GameNewsTab = {
            Cricket: "क्रिकेट",
            Football: "फूट्बौल",
            Hockey: "हौक्की",
            GameStory: "खेल कहानियां"
        };

        $scope.CricketNews = {
            PageUrl: "#",
            ID: "#",
            ImageUrl: "Images/GameSection/cricket/mainmng.jpg",
            ImageCaption: "आईसीसी ट्वेंटी-20 विश्वकप",
            GameName: "",
            ShortDesc: "दक्षिण अफ्रीका के कप्तान एबी डीविलियर्स का मानना है कि उनकी टीम आईसीसी ट्वेंटी-20 विश्वकप से पहले खुद को तैयार कर रही है लेकिन टीम के खिलाड़ियों को परिस्थतियों के अनुकूल खुद को ढालने की जरूरत है। ",
            SimpleNewsList: [
                { ID: "#", Order: 1, Heading: "चोटिल शिखर धवन श्रीलंका दौरे से बाहर" },
                { ID: "#", Order: 2, Heading: "30 साल बाद अपने पिता का इतिहास दोहरायेंगे स्टुअर्ट बिन्नी" },
                { ID: "#", Order: 3, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" },
                { ID: "#", Order: 4, Heading: "शीर्ष क्रम की कमजोर कड़ी साबित हो रहे हैं रोहित शर्मा" },
                { ID: "#", Order: 5, Heading: "जीत के बाद खिलाड़ियों ने संगकारा को कंधों पर उठाया" },
                { ID: "#", Order: 6, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" }
            ]
        };

        $scope.Football = {
            PageUrl: "#",
            ID: "#",
            ImageUrl: "Images/GameSection/cricket/mainmng.jpg",
            ImageCaption: "आईसीसी ट्वेंटी-20 विश्वकप",
            GameName: "",
            ShortDesc: "दक्षिण अफ्रीका के कप्तान एबी डीविलियर्स का मानना है कि उनकी टीम आईसीसी ट्वेंटी-20 विश्वकप से पहले खुद को तैयार कर रही है लेकिन टीम के खिलाड़ियों को परिस्थतियों के अनुकूल खुद को ढालने की जरूरत है। ",
            SimpleNewsList: [
                { ID: "#", Order: 1, Heading: "चोटिल शिखर धवन श्रीलंका दौरे से बाहर" },
                { ID: "#", Order: 2, Heading: "30 साल बाद अपने पिता का इतिहास दोहरायेंगे स्टुअर्ट बिन्नी" },
                { ID: "#", Order: 3, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" },
                { ID: "#", Order: 4, Heading: "शीर्ष क्रम की कमजोर कड़ी साबित हो रहे हैं रोहित शर्मा" },
                { ID: "#", Order: 5, Heading: "जीत के बाद खिलाड़ियों ने संगकारा को कंधों पर उठाया" },
                { ID: "#", Order: 6, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" }
            ]
        };

        $scope.Hockey = {
            PageUrl: "#",
            ID: "#",
            ImageUrl: "Images/GameSection/cricket/mainmng.jpg",
            ImageCaption: "आईसीसी ट्वेंटी-20 विश्वकप",
            GameName: "",
            ShortDesc: "दक्षिण अफ्रीका के कप्तान एबी डीविलियर्स का मानना है कि उनकी टीम आईसीसी ट्वेंटी-20 विश्वकप से पहले खुद को तैयार कर रही है लेकिन टीम के खिलाड़ियों को परिस्थतियों के अनुकूल खुद को ढालने की जरूरत है। ",
            SimpleNewsList: [
                { ID: "#", Order: 1, Heading: "चोटिल शिखर धवन श्रीलंका दौरे से बाहर" },
                { ID: "#", Order: 2, Heading: "30 साल बाद अपने पिता का इतिहास दोहरायेंगे स्टुअर्ट बिन्नी" },
                { ID: "#", Order: 3, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" },
                { ID: "#", Order: 4, Heading: "शीर्ष क्रम की कमजोर कड़ी साबित हो रहे हैं रोहित शर्मा" },
                { ID: "#", Order: 5, Heading: "जीत के बाद खिलाड़ियों ने संगकारा को कंधों पर उठाया" },
                { ID: "#", Order: 6, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" }
            ]
        };

        $scope.GameStory = {
            PageUrl: "#",
            ID: "#",
            ImageUrl: "Images/GameSection/cricket/mainmng.jpg",
            ImageCaption: "आईसीसी ट्वेंटी-20 विश्वकप",
            GameName: "",
            ShortDesc: "दक्षिण अफ्रीका के कप्तान एबी डीविलियर्स का मानना है कि उनकी टीम आईसीसी ट्वेंटी-20 विश्वकप से पहले खुद को तैयार कर रही है लेकिन टीम के खिलाड़ियों को परिस्थतियों के अनुकूल खुद को ढालने की जरूरत है। ",
            SimpleNewsList: [
                { ID: "#", Order: 1, Heading: "चोटिल शिखर धवन श्रीलंका दौरे से बाहर" },
                { ID: "#", Order: 2, Heading: "30 साल बाद अपने पिता का इतिहास दोहरायेंगे स्टुअर्ट बिन्नी" },
                { ID: "#", Order: 3, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" },
                { ID: "#", Order: 4, Heading: "शीर्ष क्रम की कमजोर कड़ी साबित हो रहे हैं रोहित शर्मा" },
                { ID: "#", Order: 5, Heading: "जीत के बाद खिलाड़ियों ने संगकारा को कंधों पर उठाया" },
                { ID: "#", Order: 6, Heading: "आईसीसी टेस्ट रैंकिंग: अश्विन टॉप टेन में, शिखर 15 स्थान उछले" }
            ]
        };
    };
})();