var AboutUs ="आनंद इंफोटेनमेंट एक भरोसेमंद साथी की तरह आपके आसपास की खबरों और आइडियाज का अध्ययन करेगा और निडर होकर आपके सामने सारे तथ्य लाएगा। \
              हमारी टीम खबर पर नजर रखने के साथ देश-दुनिया और बदलते हुए समाज को भी प्रतिबिंबित करेगी और आपको एक अलग ही नजरिया देगी। \
              यह सही है या गलत, इसके बारे में आप कुछ लिखना चाहते हैं तो आपके विचार आमंत्रित हैं। \
              आनंद इंफोटेनमेंट जनसंपर्क, विज्ञापन, पत्रकारिता और अलग-अगल विषयों के अनुभव वाले असाधारण प्रतिभाशाली पेशेवर लोगों का मिश्रण है।  \
              आनंद इंफोटेनमेंट एक टीम वर्क है जो कुछ चुनिंदा क्षेत्रों में जैसे स्वास्थ्य, लाइफस्टाइल, शिक्षा, उपयोग में आने वाली वस्तुएं और सार्वजनिक मामलों में काम करता है। \
              आनंद इंफोटेनमेंट एक प्रबंधन की तरह काम करता है। सर्विसिंग को बढ़ाने और आनंद इंफोटेनमेंट को अलग तरह की सोच देने के बारे में लगातार सोचें।  \
              आनंद इंफोटेनमेंट बोर्ड के तीन डायरेक्टर होते हैं जो विज्ञापन, कॉर्पोरेट संचार, कानून और सरकार के अलग-अलग डोमेन से होते हैं। \
              आनंद इंफोटेनमेंट एजेंसी के ग्राहकों को जानकारी देने के लिए अलग-अलग उद्योगों के एक्सपर्टों सहित सलाहकारों और मीडिया का एक पैनल है।";

var SocilMediaLink = {
    FaceBook: "https://www.facebook.com/anandcreation/?ref=hl",
    GPlus: "#",
    Twiter: "#",
    LinkedIn:"#"
};